Ran Plan for project: `dev` dir: `environments/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
+ resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "koreacentral"
      + name     = "rg-atlantis-dev"
    }

  # module.networking.azurerm_subnet.this will be created
+ resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.10.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-app"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-atlantis-dev"
      + virtual_network_name                          = "vnet-atlantis"
    }

  # module.networking.azurerm_virtual_network.this will be created
+ resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.10.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "koreacentral"
      + name                           = "vnet-atlantis"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-atlantis-dev"
      + subnet                         = (known after apply)
    }

  # module.vm.azurerm_linux_virtual_machine.this will be created
+ resource "azurerm_linux_virtual_machine" "this" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureuser"
      + allow_extension_operations                             = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "koreacentral"
      + max_bid_price                                          = -1
      + name                                                   = "vm-atlantis"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-atlantis-dev"
      + size                                                   = "Standard_B1s"
      + tags                                                   = {
          + "Environment" = "development"
          + "ManagedBy"   = "Terraform-Atlantis"
          + "Owner"       = "Development-Team"
          + "Project"     = "GitOps-Demo"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm.azurerm_network_interface.this will be created
+ resource "azurerm_network_interface" "this" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "koreacentral"
      + mac_address                    = (known after apply)
      + name                           = "nic-atlantis"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-atlantis-dev"
      + tags                           = {
          + "Environment" = "development"
          + "ManagedBy"   = "Terraform-Atlantis"
          + "Owner"       = "Development-Team"
          + "Project"     = "GitOps-Demo"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm.azurerm_public_ip.this will be created
+ resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "koreacentral"
      + name                    = "pip-atlantis"
      + resource_group_name     = "rg-atlantis-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "development"
          + "ManagedBy"   = "Terraform-Atlantis"
          + "Owner"       = "Development-Team"
          + "Project"     = "GitOps-Demo"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ public_ip = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://20.214.243.5:4141/lock?id=Seunghwan-You%252Fterraform-atlantis-demo%252Fenvironments%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p dev
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```